#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]

#+LaTeX_HEADER: \usepackage[utf8]{inputenc}
#+LaTeX_HEADER: \usepackage[T1,T2A]{fontenc}
#+LaTeX_HEADER: \usepackage[english,russian]{babel}
#+LaTeX_HEADER: \usepackage[unicode]{hyperref}
#+LATEX_HEADER: \hypersetup{colorlinks, citecolor=black, filecolor=black, linkcolor=black, urlcolor=blue}
#+LaTeX_HEADER: \usepackage{amssymb}
#+LaTeX_HEADER: \usepackage{amsmath}

*** Check $x$
#+NAME: initial
#+BEGIN_SRC python
  from sympy.solvers import solve
  from sympy import Symbol

  x = Symbol('x')

  return solve(x**2 - 1, x)
  #+END_SRC

#+RESULTS: initial
| -1 | 1 |

*** Without $f(x)$

$$x^{4} + x^{3} + x^{2} + x -1$$

#+BEGIN_SRC python
  from sympy.solvers import solve
  from sympy import Symbol

  x = Symbol('x')

  return solve(x**4 + x**3 -x**2 +x -2, x)
#+END_SRC

#+RESULTS:
| -2 | 1 | -I | I |

**** Factor all $x$
$$x(x^{3} + x^{2} - x + 1) -2$$

#+BEGIN_SRC python
  from sympy.solvers import solve
  from sympy import Symbol

  x = Symbol('x')

  return solve(x * (x**3 + x**2 - x + 1) - 2, x)
#+END_SRC

#+RESULTS:
| -2 | 1 | -I | I |

***** Factor in brackets
$$x(x^{2} (x + 1) - x + 1) -2$$

#+BEGIN_SRC python
  from sympy.solvers import solve
  from sympy import Symbol

  x = Symbol('x')

  return solve(x * (x**2 * (x + 1) - x + 1) - 2)
#+END_SRC

#+RESULTS:
| -2 | 1 | -I | I |

******* first

$$x^2(x^2+x)-x^2+x-2$$

#+BEGIN_SRC python
  from sympy.solvers import solve
  from sympy import Symbol

  x = Symbol('x')
  
  return solve(x**2*(x**2+x)-x**2+x-2)
#+END_SRC

#+RESULTS:
| -2 | 1 | -I | I |

******** src
#+BEGIN_SRC python
  from sympy.solvers import solve
  from sympy import Symbol

  x = Symbol('x')

  return solve(x**3*(x+1)-x**2+x-2)
#+END_SRC

#+RESULTS:
| -2 | 1 | -I | I |

******** src
#+BEGIN_SRC python
  from sympy.solvers import solve
  from sympy import Symbol

  x = Symbol('x')
  
  return solve(x**3*(x+1)-x*(x-1)-2)
#+END_SRC

#+RESULTS:
| -2 | 1 | -I | I |

******* Next
#+BEGIN_SRC python
  from sympy.solvers import solve
  from sympy import Symbol

  x = Symbol('x')
  
  return solve((x+1)*(x**3-x)-2)
#+END_SRC

#+RESULTS:
| -1/4 | - | sqrt | (-10/ (9* (-91/216 + sqrt (201) /24) ** (1/3)) + 11/12 + 2* (-91/216 + sqrt (201) /24) ** (1/3)) | /2 | - | sqrt | (-3/ (4*sqrt (-10/ (9* (-91/216 + sqrt (201) /24) ** (1/3)) + 11/12 + 2* (-91/216 + sqrt (201) /24) ** (1/3))) - 2* (-91/216 + sqrt (201) /24) ** (1/3) + 11/6 + 10/ (9* (-91/216 + sqrt (201) /24) ** (1/3))) | /2 | -1/4 | - | sqrt | (-10/ (9* (-91/216 + sqrt (201) /24) ** (1/3)) + 11/12 + 2* (-91/216 + sqrt (201) /24) ** (1/3)) | /2 | + | sqrt | (-3/ (4*sqrt (-10/ (9* (-91/216 + sqrt (201) /24) ** (1/3)) + 11/12 + 2* (-91/216 + sqrt (201) /24) ** (1/3))) - 2* (-91/216 + sqrt (201) /24) ** (1/3) + 11/6 + 10/ (9* (-91/216 + sqrt (201) /24) ** (1/3))) | /2 | -1/4 | + | sqrt | (-10/ (9* (-91/216 + sqrt (201) /24) ** (1/3)) + 11/12 + 2* (-91/216 + sqrt (201) /24) ** (1/3)) | /2 | + | sqrt | (-2* (-91/216 + sqrt (201) /24) ** (1/3) + 11/6 + 10/ (9* (-91/216 + sqrt (201) /24) ** (1/3)) + 3/ (4*sqrt (-10/ (9* (-91/216 + sqrt (201) /24) ** (1/3)) + 11/12 + 2* (-91/216 + sqrt (201) /24) ** (1/3)))) | /2 | -sqrt | (-2* (-91/216 + sqrt (201) /24) ** (1/3) + 11/6 + 10/ (9* (-91/216 + sqrt (201) /24) ** (1/3)) + 3/ (4*sqrt (-10/ (9* (-91/216 + sqrt (201) /24) ** (1/3)) + 11/12 + 2* (-91/216 + sqrt (201) /24) ** (1/3)))) | /2 | - | 1/4 | + | sqrt | (-10/ (9* (-91/216 + sqrt (201) /24) ** (1/3)) + 11/12 + 2* (-91/216 + sqrt (201) /24) ** (1/3)) | /2 |

****** Next

#+BEGIN_SRC python :var x=initial
  return (x+1)*x*(x**2-1)-2
#+END_SRC

#+RESULTS:
: 15838



**** Factor by grouping

$$x^{2}(x^{2} + x) - x^{2} + x -2$$

#+BEGIN_SRC python :var x=initial
  return x**2 * (x**2 + x) - x**2 + x -2
#+END_SRC

#+RESULTS:
: 15860


